src/Enums/СтатусыЗадач/СтатусыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗадач</name>
  <enumValues>
    <name>Завершена</name>
  </enumValues>
  <enumValues>
    <name>ЖдетКонтроля</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>ЖдетВыполнения</name>
  </enumValues>
  <enumValues>
    <name>НаОценке</name>
  </enumValues>
  <enumValues>
    <name>Новая</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Задачи/Задачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Задачи</name>
  <owners>Catalog.Проекты</owners>
  <attributes>
    <name>ПрефиксВетки</name>
    <type>
      <types>CatalogRef.ПрефиксыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодробноеОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДорабатыватьКонфигурацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаBitrix</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВеткаGit</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Стадия</name>
    <type>
      <types>CatalogRef.СтадииКанбан</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяВетки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗадачи</name>
    <type>
      <types>EnumRef.СтатусыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗатраченноеВремя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановоеВремя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КрайнийСрок</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Спринт</name>
    <type>
      <types>CatalogRef.Спринты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачиБазовой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЗадача</name>
    <type>
      <types>CatalogRef.Задачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.ТипыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПланировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИзменятьКрайнийСрок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипБазовойЗадачи</name>
    <type>
      <types>EnumRef.ТипыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияБазовойЗадачи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачиИтилиум</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Решение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаРелиза</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаMergeRequest</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнешниеФайлы</name>
    <attributes>
      <name>Обработка</name>
      <type>
        <types>CatalogRef.ОбъектыРазработки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расширения</name>
    <attributes>
      <name>Расширение</name>
      <type>
        <types>CatalogRef.ОбъектыРазработки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КасаемыеПроцессы</name>
    <attributes>
      <name>Процесс</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолноеИмяПроцесса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комментарии</name>
    <attributes>
      <name>ИДКомментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Спринты</name>
    <attributes>
      <name>Спринт</name>
      <type>
        <types>CatalogRef.Спринты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоСпринтРазработки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФактическиеТрудозатраты</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗатраченноеВремя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвязанныеЗадачи</name>
    <attributes>
      <name>Задача</name>
      <type>
        <types>CatalogRef.Задачи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Наблюдатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/РаботаСJira/Module.bsl
// @strict-types


#Область ПрограммныйИнтерфейс

Процедура ОбновитьДанныеЗадач() Экспорт
	
	ТаблицаЗадач = Справочники.Задачи.НеЗакрытыеЗадачи();
	ОбновитьДанныеЗадачПоТаблице(ТаблицаЗадач);
	
КонецПроцедуры

Процедура ОбновитьДанныеЗадачПоТаблице(ТаблицаЗадач) Экспорт
	
КонецПроцедуры

Функция СтруктурированныеДанныеПоЗадаче(НомерЗадачи, ТаскТрекер = Неопределено, Проект = Неопределено) Экспорт
	
	ДанныеЗаполнения = Справочники.Задачи.НовыйДанныеЗадачи();
	ИнформацияОЗадаче = ДанныеЗадачиЖира(НомерЗадачи, ТаскТрекер);
	
	Если ИнформацияОЗадаче["errorMessages"] <> Неопределено Тогда
		ВызватьИсключение(ИнформацияОЗадаче["errorMessages"][0]);
	КонецЕсли;

	Задача = ИнформацияОЗадаче["issues"][0];
	
	ДанныеЗаполнения.Наименование = Задача["fields"]["summary"];
	ДанныеЗаполнения.ПодробноеОписание = Задача["fields"]["description"];
	
	Ответственный = НайтиСоздатьПользователя(Задача["fields"]["assignee"]["displayName"], Неопределено);
	ДанныеЗаполнения.Ответственный = Ответственный;
	
	Постановщик = НайтиСоздатьПользователя(Задача["fields"]["creator"]["displayName"], Неопределено);
	ДанныеЗаполнения.Постановщик = Постановщик;
	
	СоответствиеСтатусов = СоответствиеСтатусов();
	Статус = СоответствиеСтатусов.Получить(Задача["fields"]["status"]);
	Если Статус = Неопределено Тогда
		Статус = Перечисления.СтатусыЗадач.Новая;
	КонецЕсли;
	
	ДанныеЗаполнения.Статус = Статус;
	ДанныеЗаполнения.СтатусЗадачи = Статус;
	ДанныеЗаполнения.ДатаСоздания = ПрочитатьДатуJSON(Задача["fields"]["created"], ФорматДатыJSON.ISO);
	ДанныеЗаполнения.НомерЗадачи = НомерЗадачи;
	ДанныеЗаполнения.ИмяВетки = НомерЗадачи;

	ДанныеЗаполнения.Владелец = Проект; // todo Определять по проекту из Жиры

	Возврат ДанныеЗаполнения;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеЗадачиЖира(НомерЗадачи, ТаскТрекер)
	
	РеквизитыТаскТрекера = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТаскТрекер, "URL, Логин");
	УстановитьПривилегированныйРежим(Истина);
	СекретныеДанные = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ТаскТрекер, "Токен, Пароль" );
	УстановитьПривилегированныйРежим(Ложь);
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("jql", СтрШаблон("key=%1", НомерЗадачи));
	
	ДополнительныеПараметры = КоннекторHTTP.НовыеПараметры();
	ДополнительныеПараметры.Аутентификация = Новый Структура;
	ДополнительныеПараметры.Аутентификация.Вставить("Пользователь", РеквизитыТаскТрекера.Логин);
	ДополнительныеПараметры.Аутентификация.Вставить("Пароль", СекретныеДанные.Токен);
	
	ДанныеЗапроса = КоннекторHTTP.GetJson(СтрШаблон("%1/rest/api/2/search", РеквизитыТаскТрекера.URL), ПараметрыЗапроса, ДополнительныеПараметры);
	
	Возврат ДанныеЗапроса;	
	
КонецФункции

Функция НайтиСоздатьПользователя(ИмяПользователя, IDПользователя)
	
	// todo Сделать привязку по Идентификатору
	
	УстановитьПривилегированныйРежим(Истина);

	ТекПользователь = Справочники.Пользователи.НайтиПоНаименованию(ИмяПользователя, Истина);
	ПользовательСуществует = ЗначениеЗаполнено(ТекПользователь);
	
	Если НЕ ПользовательСуществует Тогда
		Пользователь = Справочники.Пользователи.СоздатьЭлемент();
		Пользователь.Наименование = ИмяПользователя;
		Пользователь.Записать();
		ТекПользователь = Пользователь.Ссылка;
	КонецЕсли;
	
	Возврат ТекПользователь;
	
КонецФункции

Функция СоответствиеСтатусов()
	
	СоответствиеСтатусов = Новый Соответствие;
	СоответствиеСтатусов.Вставить("К выполнению", Перечисления.СтатусыЗадач.Новая);
	СоответствиеСтатусов.Вставить("В работе", Перечисления.СтатусыЗадач.Выполняется);
	СоответствиеСтатусов.Вставить("Ожидает тестирования", Перечисления.СтатусыЗадач.ЖдетКонтроля);
	СоответствиеСтатусов.Вставить("Тестирование", Перечисления.СтатусыЗадач.ЖдетКонтроля);
	СоответствиеСтатусов.Вставить("ФИЧА-РЕВЬЮ", Перечисления.СтатусыЗадач.ЖдетКонтроля);
	СоответствиеСтатусов.Вставить("КОД_РЕВЬЮ", Перечисления.СтатусыЗадач.ЖдетКонтроля);
	СоответствиеСтатусов.Вставить("Ожидает помещения", Перечисления.СтатусыЗадач.ЖдетВыполнения);
	СоответствиеСтатусов.Вставить("Ожидает обновления", Перечисления.СтатусыЗадач.ЖдетВыполнения);
	СоответствиеСтатусов.Вставить("У инициатора", Перечисления.СтатусыЗадач.ЖдетВыполнения);
	СоответствиеСтатусов.Вставить("ГОТОВО", Перечисления.СтатусыЗадач.Завершена);
	СоответствиеСтатусов.Вставить("Won't Do", Перечисления.СтатусыЗадач.Завершена);

	Возврат СоответствиеСтатусов;
	
КонецФункции

#КонецОбласти
